ZalgoSoft/esp32-cam-webserver/app_httpd.cpp
// Original Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include <esp_http_server.h>
#include <esp_timer.h>
#include <esp_camera.h>
#include <esp_int_wdt.h>
#include <esp_task_wdt.h>
#include <Arduino.h>
#include <WiFi.h>

//#include <TLog.h>      // The T-Logging library.
//#include <TelnetSerialStream.h>
#include <sys/socket.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <freertos/FreeRTOSConfig.h>
#include <ESP32Servo.h>
#include <esp_log.h>
#include "index_ov2640.h"
#include "index_ov3660.h"
#include "index_other.h"
#include "css.h"
#include "src/favicons.h"
#include "src/logo.h"
#include "storage.h"

// Functions from the main .ino
extern void flashLED(int flashtime);
extern void setLamp(int newVal);
extern void printLocalTime(bool extraData);
extern void print_client_ip(httpd_req_t *req);
// External variables declared in the main .ino
extern char myName[];
extern char myVer[];
extern char baseVersion[];
extern IPAddress ip;
extern IPAddress net;
extern IPAddress gw;
extern bool accesspoint;
extern char apName[];
extern bool captivePortal;
extern int httpPort;
extern int streamPort;
extern char httpURL[];
extern char streamURL[];
extern char default_index[];
extern int8_t streamCount;
extern unsigned long streamsServed;
extern unsigned long imagesServed;
extern int myRotation;
extern int minFrameTime;
extern int lampVal;
extern bool autoLamp;
extern bool filesystem;
extern String critERR;
extern bool debugData;
extern bool haveTime;
extern int sketchSize;
extern int sketchSpace;
extern String sketchMD5;
extern bool otaEnabled;
extern char otaPassword[];
extern unsigned long xclk;
extern int sensorPID;
static const char* TAG = "httpd";

extern Servo servo1;
extern Servo servo2;
extern int Servo1Pin;
extern int Servo2Pin;
extern int Servo_Step;
extern int ptz_y;
extern int ptz_x;
typedef struct {
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char* _STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char* _STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char* _STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

// Flag that can be set to kill all active streams
bool streamKill;

#ifdef __cplusplus
extern "C" {
#endif
uint8_t temprature_sens_read();
#ifdef __cplusplus
}
#endif

void serialDump() {
  //ESP_LOGI(TAG, );
  // Module
  ESP_LOGI(TAG, "Name: %s\r\n", myName);
  if (haveTime) {
    ESP_LOGI(TAG, "Time: ");
    printLocalTime(true);
  }
  ESP_LOGI(TAG, "Firmware: %s (base: %s)\r\n", myVer, baseVersion);
  float sketchPct = 100 * sketchSize / sketchSpace;
  ESP_LOGI(TAG, "Sketch Size: %i (total: %i, %.1f%% used)\r\n", sketchSize, sketchSpace, sketchPct);
  ESP_LOGI(TAG, "MD5: %s\r\n", sketchMD5.c_str());
  ESP_LOGI(TAG, "ESP sdk: %s\r\n", ESP.getSdkVersion());
  ESP_LOGI(TAG, "This thread core affinity: ");
  ESP_LOGI(TAG, xPortGetCoreID());
  if (otaEnabled) {
    if (strlen(otaPassword) != 0) {
      ESP_LOGI(TAG, "OTA: Enabled, Password: %s\n\r", otaPassword);
    } else {
      ESP_LOGI(TAG, "OTA: Enabled, No Password! (insecure)\n\r");
    }
  } else {
    ESP_LOGI(TAG, "OTA: Disabled\n\r");
  }
  // Network
  if (accesspoint) {
    if (captivePortal) {
      ESP_LOGI(TAG, "WiFi Mode: AccessPoint with captive portal\r\n");
    } else {
      ESP_LOGI(TAG, "WiFi Mode: AccessPoint\r\n");
    }
    ESP_LOGI(TAG, "WiFi SSID: %s\r\n", apName);
  } else {
    ESP_LOGI(TAG, "WiFi Mode: Client\r\n");
    String ssidName = WiFi.SSID();
    ESP_LOGI(TAG, "WiFi Ssid: %s\r\n", ssidName.c_str());
    ESP_LOGI(TAG, "WiFi Rssi: %i\r\n", WiFi.RSSI());
    String bssid = WiFi.BSSIDstr();
    ESP_LOGI(TAG, "WiFi BSSID: %s\r\n", bssid.c_str());
  }
  ESP_LOGI(TAG, "WiFi IP address: %d.%d.%d.%d\r\n", ip[0], ip[1], ip[2], ip[3]);
  if (!accesspoint) {
    ESP_LOGI(TAG, "WiFi Netmask: %d.%d.%d.%d\r\n", net[0], net[1], net[2], net[3]);
    ESP_LOGI(TAG, "WiFi Gateway: %d.%d.%d.%d\r\n", gw[0], gw[1], gw[2], gw[3]);
  }
  ESP_LOGI(TAG, "WiFi Http port: %i, Stream port: %i\r\n", httpPort, streamPort);
  byte mac[6];
  WiFi.macAddress(mac);
  ESP_LOGI(TAG, "WiFi MAC: %02X:%02X:%02X:%02X:%02X:%02X\r\n", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  // System
  int64_t sec = esp_timer_get_time() / 1000000;
  int64_t upDays = int64_t(floor(sec / 86400));
  int upHours = int64_t(floor(sec / 3600)) % 24;
  int upMin = int64_t(floor(sec / 60)) % 60;
  int upSec = sec % 60;
  int McuTc = (temprature_sens_read() - 32) / 1.8; // celsius
  int McuTf = temprature_sens_read(); // fahrenheit
  ESP_LOGI(TAG, "System up: %" PRId64 ":%02i:%02i:%02i (d:h:m:s)\r\n", upDays, upHours, upMin, upSec);
  ESP_LOGI(TAG, "Active streams: %i, Previous streams: %lu, Images captured: %lu\r\n", streamCount, streamsServed, imagesServed);
  ESP_LOGI(TAG, "CPU Freq: %i MHz, Xclk Freq: %i MHz\r\n", ESP.getCpuFreqMHz(), xclk);
  ESP_LOGI(TAG, "MCU temperature : %i C, %i F  (approximate)\r\n", McuTc, McuTf);
  ESP_LOGI(TAG, "Heap: %i, free: %i, min free: %i, max block: %i\r\n", ESP.getHeapSize(), ESP.getFreeHeap(), ESP.getMinFreeHeap(), ESP.getMaxAllocHeap());
  if (psramFound()) {
    ESP_LOGI(TAG, "Psram: %i, free: %i, min free: %i, max block: %i\r\n", ESP.getPsramSize(), ESP.getFreePsram(), ESP.getMinFreePsram(), ESP.getMaxAllocPsram());
  } else {
    ESP_LOGI(TAG, "Psram: Not found; please check your board configuration.\r\n");
    ESP_LOGI(TAG, "- High resolution/quality settings will show incomplete frames to low memory.\r\n");
  }
  // Filesystems
  if (filesystem && (SPIFFS.totalBytes() > 0)) {
    ESP_LOGI(TAG, "Spiffs: %i, used: %i\r\n", SPIFFS.totalBytes(), SPIFFS.usedBytes());
  } else {
    ESP_LOGI(TAG, "Spiffs: No filesystem found, please check your board configuration.\r\n");
    ESP_LOGI(TAG, "- Saving and restoring camera settings will not function without this.\r\n");
  }
  ESP_LOGI(TAG, "Preferences file: ");
  dumpPrefs(SPIFFS);
  if (critERR.length() > 0) {
    ESP_LOGI(TAG, "\r\n\r\nAn error or halt has occurred with Camera Hardware, see previous messages.\r\n");
    ESP_LOGI(TAG, "A reboot is required to recover from this.\r\nError message: (html)\r\n %s\r\n\r\n", critERR.c_str());
  }
  //ESP_LOGI(TAG, );
  return;
}

static esp_err_t capture_handler(httpd_req_t *req) {
  camera_fb_t * fb = NULL;
  esp_err_t res = ESP_OK;

  ESP_LOGI(TAG, "capture_handler CPU ");
  ESP_LOGI(TAG, xPortGetCoreID());
  if (autoLamp && (lampVal != -1)) {
    setLamp(lampVal);
    delay(75); // coupled with the status led flash this gives ~150ms for lamp to settle.
  }
  flashLED(75); // little flash of status LED

  int64_t fr_start = esp_timer_get_time();

  fb = esp_camera_fb_get();
  if (!fb) {
    ESP_LOGI(TAG, "CAPTURE: failed to acquire frame");
    httpd_resp_send_500(req);
    if (autoLamp && (lampVal != -1)) setLamp(0);
    return ESP_FAIL;
  }

