ZalgoSoft/esp32-cam-webserver/app_httpd.cpp
  httpd_resp_set_type(req, "image/jpeg");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.jpg");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  size_t fb_len = 0;
  if (fb->format == PIXFORMAT_JPEG) {
    fb_len = fb->len;
    res = httpd_resp_send(req, (const char *)fb->buf, fb->len);
  } else {
    res = ESP_FAIL;
    ESP_LOGI(TAG, "Capture Error: Non-JPEG image returned by camera module");
  }
  esp_camera_fb_return(fb);
  fb = NULL;

  int64_t fr_end = esp_timer_get_time();
  if (debugData) {
    ESP_LOGI(TAG, "JPG: %uB %ums\r\n", (uint32_t)(fb_len), (uint32_t)((fr_end - fr_start) / 1000));
  }
  imagesServed++;
  if (autoLamp && (lampVal != -1)) {
    setLamp(0);
  }
  return res;
}

static esp_err_t stream_handler(httpd_req_t *req) {
  camera_fb_t * fb = NULL;
  esp_err_t res = ESP_OK;
  size_t _jpg_buf_len = 0;
  uint8_t * _jpg_buf = NULL;
  char * part_buf[64];

  streamKill = false;

  print_client_ip(req); ESP_LOGI(TAG, "Stream requested");
  ESP_LOGI(TAG, " stream_handler CPU ");
  ESP_LOGI(TAG, xPortGetCoreID());
  if (autoLamp && (lampVal != -1)) setLamp(lampVal);
  streamCount = 1;  // at present we only have one stream handler, so values are 0 or 1..
  flashLED(75);     // double flash of status LED
  delay(75);
  flashLED(75);

  static int64_t last_frame = 0;
  if (!last_frame) {
    last_frame = esp_timer_get_time();
  }

  res = httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
  if (res != ESP_OK) {
    streamCount = 0;
    if (autoLamp && (lampVal != -1)) setLamp(0);
    ESP_LOGI(TAG, "STREAM: failed to set HTTP response type");
    return res;
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  if (res == ESP_OK) {
    res = httpd_resp_send_chunk(req, _STREAM_BOUNDARY, strlen(_STREAM_BOUNDARY));
  }

  while (true) {
    fb = esp_camera_fb_get();
    if (!fb) {
      ESP_LOGI(TAG, "STREAM: failed to acquire frame");
      res = ESP_FAIL;
    } else {
      if (fb->format != PIXFORMAT_JPEG) {
        ESP_LOGI(TAG, "STREAM: Non-JPEG frame returned by camera module");
        res = ESP_FAIL;
      } else {
        _jpg_buf_len = fb->len;
        _jpg_buf = fb->buf;
      }
    }
    if (res == ESP_OK) {
      size_t hlen = snprintf((char *)part_buf, 64, _STREAM_PART, _jpg_buf_len);
      res = httpd_resp_send_chunk(req, (const char *)part_buf, hlen);
    }
    if (res == ESP_OK) {
      res = httpd_resp_send_chunk(req, (const char *)_jpg_buf, _jpg_buf_len);
    }
    if (res == ESP_OK) {
      res = httpd_resp_send_chunk(req, _STREAM_BOUNDARY, strlen(_STREAM_BOUNDARY));
    }
    if (fb) {
      esp_camera_fb_return(fb);
      fb = NULL;
      _jpg_buf = NULL;
    } else if (_jpg_buf) {
      free(_jpg_buf);
      _jpg_buf = NULL;
    }
    if (res != ESP_OK) {
      // This is the error exit point from the stream loop.
      // We end the stream here only if a Hard failure has been encountered or the connection has been interrupted.
      ESP_LOGI(TAG, "Stream failed, code = %i : %s\r\n", res, esp_err_to_name(res));
      break;
    }
    if ((res != ESP_OK) || streamKill) {
      // We end the stream here when a kill is signalled.
      ESP_LOGI(TAG, "Stream killed\r\n");
      break;
    }
    int64_t frame_time = esp_timer_get_time() - last_frame;
    frame_time /= 1000;
    int32_t frame_delay = (minFrameTime > frame_time) ? minFrameTime - frame_time : 0;
    delay(frame_delay);

    if (debugData) {
      ESP_LOGI(TAG, "MJPG: %uB %ums, delay: %ums, framerate (%.1ffps)\r\n",
               (uint32_t)(_jpg_buf_len),
               (uint32_t)frame_time, frame_delay, 1000.0 / (uint32_t)(frame_time + frame_delay));
    }
    last_frame = esp_timer_get_time();
  }

  streamsServed++;
  streamCount = 0;
  if (autoLamp && (lampVal != -1)) setLamp(0);
  ESP_LOGI(TAG, "Stream ended");
  last_frame = 0;
  return res;
}

static esp_err_t cmd_handler(httpd_req_t *req) {
  char*  buf;
  size_t buf_len;
  char variable[32] = {0,};
  char value[32] = {0,};

  flashLED(75);

  buf_len = httpd_req_get_url_query_len(req) + 1;
  if (buf_len > 1) {
    buf = (char*)malloc(buf_len);
    if (!buf) {
      httpd_resp_send_500(req);
      return ESP_FAIL;
    }
    if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
      if (httpd_query_key_value(buf, "var", variable, sizeof(variable)) == ESP_OK &&
          httpd_query_key_value(buf, "val", value, sizeof(value)) == ESP_OK) {
      } else {
        free(buf);
        httpd_resp_send_404(req);
        return ESP_FAIL;
      }
    } else {
      free(buf);
      httpd_resp_send_404(req);
      return ESP_FAIL;
    }
    free(buf);
  } else {
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }

  if (critERR.length() > 0) return httpd_resp_send_500(req);

  int val = atoi(value);
  sensor_t * s = esp_camera_sensor_get();
  int res = 0;
  if (!strcmp(variable, "framesize")) {
    if (s->pixformat == PIXFORMAT_JPEG) res = s->set_framesize(s, (framesize_t)val);
  }
  else if (!strcmp(variable, "quality")) res = s->set_quality(s, val);
  else if (!strcmp(variable, "xclk")) {
    xclk = val;
    res = s->set_xclk(s, LEDC_TIMER_0, val);
  }
  else if (!strcmp(variable, "contrast")) res = s->set_contrast(s, val);
  else if (!strcmp(variable, "brightness")) res = s->set_brightness(s, val);
  else if (!strcmp(variable, "saturation")) res = s->set_saturation(s, val);
  else if (!strcmp(variable, "gainceiling")) res = s->set_gainceiling(s, (gainceiling_t)val);
  else if (!strcmp(variable, "colorbar")) res = s->set_colorbar(s, val);
  else if (!strcmp(variable, "awb")) res = s->set_whitebal(s, val);
  else if (!strcmp(variable, "agc")) res = s->set_gain_ctrl(s, val);
  else if (!strcmp(variable, "aec")) res = s->set_exposure_ctrl(s, val);
  else if (!strcmp(variable, "hmirror")) res = s->set_hmirror(s, val);
  else if (!strcmp(variable, "vflip")) res = s->set_vflip(s, val);
  else if (!strcmp(variable, "awb_gain")) res = s->set_awb_gain(s, val);
  else if (!strcmp(variable, "agc_gain")) res = s->set_agc_gain(s, val);
  else if (!strcmp(variable, "aec_value")) res = s->set_aec_value(s, val);
  else if (!strcmp(variable, "aec2")) res = s->set_aec2(s, val);
  else if (!strcmp(variable, "dcw")) res = s->set_dcw(s, val);
  else if (!strcmp(variable, "bpc")) res = s->set_bpc(s, val);
  else if (!strcmp(variable, "wpc")) res = s->set_wpc(s, val);
  else if (!strcmp(variable, "raw_gma")) res = s->set_raw_gma(s, val);
  else if (!strcmp(variable, "lenc")) res = s->set_lenc(s, val);
  else if (!strcmp(variable, "special_effect")) res = s->set_special_effect(s, val);
  else if (!strcmp(variable, "wb_mode")) res = s->set_wb_mode(s, val);
  else if (!strcmp(variable, "ae_level")) res = s->set_ae_level(s, val);
  else if (!strcmp(variable, "rotate")) myRotation = val;
  else if (!strcmp(variable, "min_frame_time")) minFrameTime = val;
  else if (!strcmp(variable, "autolamp") && (lampVal != -1)) {
    autoLamp = val;
    if (autoLamp) {
      if (streamCount > 0) setLamp(lampVal);
      else setLamp(0);
    } else {
      setLamp(lampVal);
    }
  }
  else if (!strcmp(variable, "lamp") && (lampVal != -1)) {
    lampVal = constrain(val, 0, 100);
    if (autoLamp) {
      if (streamCount > 0) setLamp(lampVal);
      else setLamp(0);
    } else {
      setLamp(lampVal);
    }
  }
  else if (!strcmp(variable, "save_prefs")) {
    if (filesystem) savePrefs(SPIFFS);
  }
  else if (!strcmp(variable, "clear_prefs")) {
    if (filesystem) removePrefs(SPIFFS);
  }
  else if (!strcmp(variable, "reboot")) {
    if (lampVal != -1) setLamp(0); // kill the lamp; otherwise it can remain on during the soft-reboot
    esp_task_wdt_init(3, true); // schedule a a watchdog panic event for 3 seconds in the future
    esp_task_wdt_add(NULL);
    periph_module_disable(PERIPH_I2C0_MODULE); // try to shut I2C down properly
    periph_module_disable(PERIPH_I2C1_MODULE);
    periph_module_reset(PERIPH_I2C0_MODULE);
    periph_module_reset(PERIPH_I2C1_MODULE);
    ESP_LOGI(TAG, "REBOOT requested");
    while (true) {
      flashLED(50);
      delay(150);
      ESP_LOGI(TAG, '.');

