ZalgoSoft/esp32-cam-webserver/app_httpd.cpp
static esp_err_t style_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/css");
  httpd_resp_set_hdr(req, "Content-Encoding", "identity");
  return httpd_resp_send(req, (const char *)style_css, style_css_len);
}

static esp_err_t streamviewer_handler(httpd_req_t *req) {
  flashLED(75);
  print_client_ip(req); ESP_LOGI(TAG, "Stream viewer requested");
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Content-Encoding", "identity");
  return httpd_resp_send(req, (const char *)streamviewer_html, streamviewer_html_len);
}

static esp_err_t error_handler(httpd_req_t *req) {
  flashLED(75);
  ESP_LOGI(TAG, "Sending error page");
  std::string s(error_html);
  size_t index;
  while ((index = s.find("<APPURL>")) != std::string::npos)
    s.replace(index, strlen("<APPURL>"), httpURL);
  while ((index = s.find("<CAMNAME>")) != std::string::npos)
    s.replace(index, strlen("<CAMNAME>"), myName);
  while ((index = s.find("<ERRORTEXT>")) != std::string::npos)
    s.replace(index, strlen("<ERRORTEXT>"), critERR.c_str());
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Content-Encoding", "identity");
  return httpd_resp_send(req, (const char *)s.c_str(), s.length());
}
void print_client_ip(httpd_req_t *req)
{
  int sockfd = httpd_req_to_sockfd(req);
  char ipstr[INET6_ADDRSTRLEN];
  struct sockaddr_in6 addr;   // esp_http_server uses IPv6 addressing
  socklen_t addr_size = sizeof(addr);
  if (getpeername(sockfd, (struct sockaddr *)&addr, &addr_size) < 0) {
    ESP_LOGI(TAG,    "Error getting client IP");
    return;
  }
  //    inet_ntop(AF_INET, &addr.sin6_addr, ipstr, sizeof(ipstr));
  inet_ntop(AF_INET, &addr.sin6_addr.un.u32_addr[3], ipstr, sizeof(ipstr));
  ESP_LOGI(TAG,    "Client IP => ");
  ESP_LOGI(TAG, ipstr);
}

static esp_err_t index_handler(httpd_req_t *req) {
  char*  buf;
  size_t buf_len;
  char view[32] = {0,};

  flashLED(75);
  // See if we have a specific target (full/simple/portal) and serve as appropriate
  buf_len = httpd_req_get_url_query_len(req) + 1;
  if (buf_len > 1) {
    buf = (char*)malloc(buf_len);
    if (!buf) {
      httpd_resp_send_500(req);
      return ESP_FAIL;
    }
    if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
      if (httpd_query_key_value(buf, "view", view, sizeof(view)) == ESP_OK) {
      } else {
        free(buf);
        httpd_resp_send_404(req);
        return ESP_FAIL;
      }
    } else {
      free(buf);
      httpd_resp_send_404(req);
      return ESP_FAIL;
    }
    free(buf);
  } else {
    // no target specified; default.
    strcpy(view, default_index);
    // If captive portal is active send that instead
    if (captivePortal) {
      strcpy(view, "portal");
    }
  }

  if  (strncmp(view, "simple", sizeof(view)) == 0) {
    print_client_ip(req) ;
    ESP_LOGI(TAG, " Simple index page requested");
    ESP_LOGI(TAG, "CPU ");
    ESP_LOGI(TAG, xPortGetCoreID());
    if (critERR.length() > 0) return error_handler(req);
    httpd_resp_set_type(req, "text/html");
    httpd_resp_set_hdr(req, "Content-Encoding", "identity");
    return httpd_resp_send(req, (const char *)index_simple_html, index_simple_html_len);
  } else if (strncmp(view, "full", sizeof(view)) == 0) {
    print_client_ip(req) ;
    ESP_LOGI(TAG,    " Full index page requested ");
    ESP_LOGI(TAG, "CPU "); ESP_LOGI(TAG, xPortGetCoreID());
    if (critERR.length() > 0) return error_handler(req);
    httpd_resp_set_type(req, "text/html");
    httpd_resp_set_hdr(req, "Content-Encoding", "identity");
    if (sensorPID == OV3660_PID) {
      return httpd_resp_send(req, (const char *)index_ov3660_html, index_ov3660_html_len);
    }
    return httpd_resp_send(req, (const char *)index_ov2640_html, index_ov2640_html_len);
  } else if (strncmp(view, "portal", sizeof(view)) == 0) {
    //Prototype captive portal landing page.
    print_client_ip(req); ESP_LOGI(TAG, "Portal page requested");
    ESP_LOGI(TAG, "CPU "); ESP_LOGI(TAG, xPortGetCoreID());
    std::string s(portal_html);
    size_t index;
    while ((index = s.find("<APPURL>")) != std::string::npos)
      s.replace(index, strlen("<APPURL>"), httpURL);
    while ((index = s.find("<STREAMURL>")) != std::string::npos)
      s.replace(index, strlen("<STREAMURL>"), streamURL);
    while ((index = s.find("<CAMNAME>")) != std::string::npos)
      s.replace(index, strlen("<CAMNAME>"), myName);
    httpd_resp_set_type(req, "text/html");
    httpd_resp_set_hdr(req, "Content-Encoding", "identity");
    return httpd_resp_send(req, (const char *)s.c_str(), s.length());
  } else  {
    print_client_ip(req); ESP_LOGI(TAG, "Unknown page requested: ");
    ESP_LOGI(TAG, view);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
}

void startCameraServer(int hPort, int sPort) {
  httpd_config_t config = HTTPD_DEFAULT_CONFIG();
  config.max_uri_handlers = 16; // we use more than the default 8 (on port 80)

  httpd_uri_t index_uri = {
    .uri       = "/",
    .method    = HTTP_GET,
    .handler   = index_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t status_uri = {
    .uri       = "/status",
    .method    = HTTP_GET,
    .handler   = status_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t cmd_uri = {
    .uri       = "/control",
    .method    = HTTP_GET,
    .handler   = cmd_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t capture_uri = {
    .uri       = "/capture",
    .method    = HTTP_GET,
    .handler   = capture_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t style_uri = {
    .uri       = "/style.css",
    .method    = HTTP_GET,
    .handler   = style_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t favicon_16x16_uri = {
    .uri       = "/favicon-16x16.png",
    .method    = HTTP_GET,
    .handler   = favicon_16x16_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t favicon_32x32_uri = {
    .uri       = "/favicon-32x32.png",
    .method    = HTTP_GET,
    .handler   = favicon_32x32_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t favicon_ico_uri = {
    .uri       = "/favicon.ico",
    .method    = HTTP_GET,
    .handler   = favicon_ico_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t logo_svg_uri = {
    .uri       = "/logo.svg",
    .method    = HTTP_GET,
    .handler   = logo_svg_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t dump_uri = {
    .uri       = "/dump",
    .method    = HTTP_GET,
    .handler   = dump_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t stop_uri = {
    .uri       = "/stop",
    .method    = HTTP_GET,
    .handler   = stop_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t stream_uri = {
    .uri       = "/",
    .method    = HTTP_GET,
    .handler   = stream_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t streamviewer_uri = {
    .uri       = "/view",
    .method    = HTTP_GET,
    .handler   = streamviewer_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t info_uri = {
    .uri       = "/info",
    .method    = HTTP_GET,
    .handler   = info_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t error_uri = {
    .uri       = "/",
    .method    = HTTP_GET,
    .handler   = error_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t viewerror_uri = {
    .uri       = "/view",
    .method    = HTTP_GET,
    .handler   = error_handler,
    .user_ctx  = NULL
  };

  // Request Handlers; config.max_uri_handlers (above) must be >= the number of handlers
  config.server_port = hPort;
  config.ctrl_port = hPort;
  //    config.core_id = 1;
  ESP_LOGI(TAG, "Starting web server on port: '%d'\r\n", config.server_port);
  if (httpd_start(&camera_httpd, &config) == ESP_OK) {
    if (critERR.length() > 0) {
      httpd_register_uri_handler(camera_httpd, &error_uri);
    } else {
      httpd_register_uri_handler(camera_httpd, &index_uri);
      httpd_register_uri_handler(camera_httpd, &cmd_uri);
      httpd_register_uri_handler(camera_httpd, &status_uri);
      httpd_register_uri_handler(camera_httpd, &capture_uri);
    }
    httpd_register_uri_handler(camera_httpd, &style_uri);
    httpd_register_uri_handler(camera_httpd, &favicon_16x16_uri);
    httpd_register_uri_handler(camera_httpd, &favicon_32x32_uri);
    httpd_register_uri_handler(camera_httpd, &favicon_ico_uri);
    httpd_register_uri_handler(camera_httpd, &logo_svg_uri);
    httpd_register_uri_handler(camera_httpd, &dump_uri);
    httpd_register_uri_handler(camera_httpd, &stop_uri);
  }

  config.server_port = sPort;
  config.ctrl_port = sPort;
  config.core_id = 0;
  ESP_LOGI(TAG, "Starting stream server on port: '%d'\r\n", config.server_port);
  if (httpd_start(&stream_httpd, &config) == ESP_OK) {
    if (critERR.length() > 0) {
      httpd_register_uri_handler(camera_httpd, &error_uri);
      httpd_register_uri_handler(camera_httpd, &viewerror_uri);
    } else {
      httpd_register_uri_handler(stream_httpd, &stream_uri);
      httpd_register_uri_handler(stream_httpd, &info_uri);
      httpd_register_uri_handler(stream_httpd, &streamviewer_uri);
    }
    httpd_register_uri_handler(stream_httpd, &favicon_16x16_uri);
    httpd_register_uri_handler(stream_httpd, &favicon_32x32_uri);
    httpd_register_uri_handler(stream_httpd, &favicon_ico_uri);
  }
}
